/********************************************************************
 created:	20012-2-10
 author:		Haven (唐小平)
 purpose:	环形内存,但是不是连续的,用于发包和收包.
 相对于连续的环形内存,会少一些内存移动,提高了性能,但是要让缓存区适当大一些.
 示意图如下:
 
 |<-BFreeSpace->|
 ____________________________________________________
 |    |      |              |         |               |
 |    |   B  |              |    A    |               |
 |____|______|______________|_________|_______________|
 |<-------SpaceBeforeA----->|    
 |<-AFreeSpace-->|
 |<-SpaceAfterA->|
 
 *********************************************************************/

#include <iostream>
